app/views/riders/index.html.haml

            -@rides.each do |ride|
                -driver = Driver.find(ride.driver_id)
---
SELECT "drivers".* FROM "drivers" WHERE (price <= 50) AND (available = 1)