app/views/riders/show.html.haml

    .row
        %h1.span.fire.driver= "#{@driver.first} #{@driver.last}"
    .row
---
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

            -@reviews.each do |rev|
                -rider = Rider.find(rev.rider_id)
---
SELECT  "riders".* FROM "riders" WHERE "riders"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]