app/controllers/drivers_controller.rb

    def show
        #homepage for driver using the app. Shows their Driver information
        #should also allow them to edit their avliablity on the fly
        #need to redirect to new if no driver for current user
        begin
          @user = User.find(current_user[:id])
          @driver = @user.driver
        rescue ActiveRecord::RecordNotFound
          redirect_to new_driver_path and return
        end
        if @driver == nil
          redirect_to new_driver_path and return
        end

        @reviews = @driver.reviews

        begin
          @active_ride = Ride.find("driver_id = ? AND done = ?",@driver.id,false)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."driver_id" = ?  [["driver_id", 2]]
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."user_id" = ? LIMIT ?  [["user_id", 7], ["LIMIT", 1]]
SELECT "rides".* FROM "rides" WHERE "rides"."id" IN (?, ?, ?)  [["id", 0], ["id", 3], ["id", 0]]

    def create
        params[:driver][:user_id] = current_user[:id]
        d = Driver.new(create_update_params)
        if params[:driver][:first] != ""
          if d.save()
---
INSERT INTO "drivers" ("first", "last", "make", "model", "plate", "seats", "available", "user_id", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def edit
        #edit driver details
        id = params[:id]
        @driver = Driver.find(id)
---
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def update
        id = params[:id]
        d = Driver.find(id)
        if params[:driver][:first] != ""
            d.update(create_update_params)
---
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "drivers" SET "model" = ?, "available" = ?, "updated_at" = ? WHERE "drivers"."id" = ?  [["model", "Steve Mobile"], ["available", 1], ["updated_at", "2019-04-05 19:17:34.694378"], ["id", 1]]