app/controllers/drivers_controller.rb

    def create
        d = Driver.new(create_update_params)
        if d.save()
---
INSERT INTO "drivers" ("first", "last", "make", "model", "plate", "available", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["first", "Steve"], ["last", ""], ["make", ""], ["model", ""], ["plate", ""], ["available", 0], ["created_at", "2019-04-05 19:17:10.105864"], ["updated_at", "2019-04-05 19:17:10.105864"]]

    def update
        id = params[:id]
        d = Driver.find(id)
        d.update(create_update_params)
        if d.save()
---
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "drivers" SET "model" = ?, "available" = ?, "updated_at" = ? WHERE "drivers"."id" = ?  [["model", "Steve Mobile"], ["available", 1], ["updated_at", "2019-04-05 19:17:34.694378"], ["id", 1]]
UPDATE "drivers" SET "available" = ?, "updated_at" = ? WHERE "drivers"."id" = ?  [["available", 1], ["updated_at", "2019-04-18 23:07:38.896526"], ["id", 8]]