app/controllers/reviews_controller.rb

SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "riders".* FROM "riders" WHERE "riders"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def new
        @review = Review.new()
        @driver = Driver.find(params[:driver_id])
        @rider = Rider.find(params[:rider_id])

SELECT "reviews".* FROM "reviews" WHERE "reviews"."driver_id" = ?  [["driver_id", 1]]
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("stars", "description", "driver_id", "rider_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["stars", 2], ["description", "puta"], ["driver_id", 1], ["rider_id", 2], ["created_at", "2019-04-19 20:51:44.829601"], ["updated_at", "2019-04-19 20:51:44.829601"]]
SELECT  "drivers".* FROM "drivers" LIMIT ?  [["LIMIT", 11]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."rider_id" = ? LIMIT ?  [["rider_id", 1], ["LIMIT", 11]]
---
    def create
        rev = Review.new(create_update_params)
        d = Driver.find(params[:review][:driver_id])
        ride = Ride.where("driver_id = ? AND rider_id = ? AND reviewed = ?",d.id,params[:review][:rider_id],false)
        ride = ride[0]
        if params[:review][:stars] != ""
            ride.reviewed = true
            if rev.save()
                if ride.save()
                    flash[:notice] = "New review for #{d.first} #{d.last}"