app/controllers/riders_controller.rb

SELECT  "riders".* FROM "riders" WHERE "riders"."user_id" = ? LIMIT ?  [["user_id", 7], ["LIMIT", 1]]
SELECT "drivers".* FROM "drivers" WHERE (price <= 10) AND (available = 1)
---
    def index
        #homepage for rider using the app
        #should show list of avaliable drivers
        #need to redirect to new if there is no rider for current user
        # byebug
        begin
          @rider = Rider.find(current_user[:id])
        rescue ActiveRecord::RecordNotFound
          redirect_to new_rider_path and return
        end
        @drivers = Driver.where("available = ?", true)

SELECT "reviews".* FROM "reviews" WHERE "reviews"."driver_id" = ?  [["driver_id", 2]]
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def show
      @reviews = Driver.find(params[:driver_id]).reviews

INSERT INTO "riders" ("first", "last", "destination", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first", "Sammy"], ["last", "butts"], ["destination", "Uranus"], ["user_id", 7], ["created_at", "2019-04-17 18:03:21.018587"], ["updated_at", "2019-04-17 18:03:21.018587"]]
---
    def create
        r = Rider.new(create_update_params)
        if params[:rider][:first] != ""
            if r.save()