app/controllers/rides_controller.rb

  def create
      @rider = Rider.find(params[:booking][:rider_id])
      @driver = Driver.find(params[:booking][:driver_id])
      params[:start] = @rider.start #aren't working properly
      params[:destination] = @rider.destination #aren't working properly
      @ride = Ride.new(create_update_params)
      @ride.done = false
      if @ride.save
          @driver.available = false
          if @driver.save
            flash[:notice] = "Successfully booked ride with #{@driver.first} #{@driver.last}"
---
SELECT  "riders".* FROM "riders" WHERE "riders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "rides" ("done", "driver_id", "rider_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["done", 0], ["driver_id", 3], ["rider_id", 1], ["created_at", "2019-04-29 18:18:45.266864"], ["updated_at", "2019-04-29 18:18:45.266864"]]
UPDATE "drivers" SET "available" = ?, "updated_at" = ? WHERE "drivers"."id" = ?  [["available", 0], ["updated_at", "2019-04-29 18:18:45.348195"], ["id", 3]]
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
      @ride = Ride.find(params[:id])
      @driver = @ride.driver
      @rider = @ride.rider
      @ride.done = true
      if @ride.save
          @driver.available = true
          if @driver.save
---
SELECT  "rides".* FROM "rides" WHERE "rides"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "drivers" SET "available" = ?, "updated_at" = ? WHERE "drivers"."id" = ?  [["available", 1], ["updated_at", "2019-04-29 18:45:12.064826"], ["id", 3]]
UPDATE "rides" SET "done" = ?, "updated_at" = ? WHERE "rides"."id" = ?  [["done", 1], ["updated_at", "2019-04-29 18:45:11.942146"], ["id", 1]]