app/controllers/riders_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def index
        #homepage for rider using the app
        #should show list of avaliable drivers
        #need to redirect to new if there is no rider for current user
        begin
          @user = User.find(current_user[:id])

SELECT  "riders".* FROM "riders" WHERE "riders"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  "riders".* FROM "riders" WHERE "riders"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
      @rider = Rider.find(params[:id])
      @driver = Driver.find(params[:driver_id])
      @reviews = @driver.reviews
      @rides = Ride.where("driver_id = ? AND rider_id = ?",@driver.id,@rider.id)

INSERT INTO "riders" ("first", "last", "start", "destination", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        params[:rider][:user_id] = current_user[:id]
        r = Rider.new(create_update_params)
        if params[:rider][:first] != ""
            if r.save()