app/views/drivers/show.html.haml

    .row
        %h1.header.review= "#{@driver.first} #{@driver.last}"
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."driver_id" = ?  [["driver_id", 3]]

                %br
                =link_to "Ride with #{@rider.first} #{@rider.last} completed!", ride_path(:id => @ride.id, :driver_id => @driver.id), :method => :patch, :class => :button
---
SELECT  "rides".* FROM "rides" WHERE (driver_id = 3 AND done = 0) LIMIT ?  [["LIMIT", 11]]

                -@reviews.each do |rev|
                    -rider = Rider.find(rev.rider_id)
---
SELECT  "riders".* FROM "riders" WHERE "riders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "rides".* FROM "rides" WHERE "rides"."id" IN (?, ?, ?)  [["id", 0], ["id", 3], ["id", 0]]